package com.letz.euler;

import org.springframework.util.StopWatch;

/**
 * 이런 식으로 맨 처음 (7 × 3 × 1 × 6 × 7 = 882) 부터 맨 끝 (6 × 3 × 4 × 5 × 0 = 0) 까지 5자리 숫자들의 곱을 구할 수 있습니다.
 * 이렇게 구할 수 있는 5자리 숫자의 곱 중에서 가장 큰 값은 얼마입니까?
 */
public class Test_008 {

    public static StringBuilder sb = new StringBuilder();

    public static void main(String[] args) throws InterruptedException {
        StopWatch sw = new StopWatch();
        sw.start();
        // TODO Auto-generated method stub
        sb.append("73167176531330624919225119674426574742355349194934");
        sb.append("96983520312774506326239578318016984801869478851843");
        sb.append("85861560789112949495459501737958331952853208805511");
        sb.append("12540698747158523863050715693290963295227443043557");
        sb.append("66896648950445244523161731856403098711121722383113");
        sb.append("62229893423380308135336276614282806444486645238749");
        sb.append("30358907296290491560440772390713810515859307960866");
        sb.append("70172427121883998797908792274921901699720888093776");
        sb.append("65727333001053367881220235421809751254540594752243");
        sb.append("52584907711670556013604839586446706324415722155397");
        sb.append("53697817977846174064955149290862569321978468622482");
        sb.append("83972241375657056057490261407972968652414535100474");
        sb.append("82166370484403199890008895243450658541227588666881");
        sb.append("16427171479924442928230863465674813919123162824586");
        sb.append("17866458359124566529476545682848912883142607690042");
        sb.append("24219022671055626321111109370544217506941658960408");
        sb.append("07198403850962455444362981230987879927244284909188");
        sb.append("84580156166097919133875499200524063689912560717606");
        sb.append("05886116467109405077541002256983155200055935729725");
        sb.append("71636269561882670428252483600823257530420752963450");

        int i = 0;
        int j = 5;
        int r = 1;
        int h = 0;
        int t1 = 0;
        for (i = 0; i < sb.length(); i++) {
//             System.out.println(i+"/"+(i+1)+" / "+ j+" / "+h);
            int t = Integer.parseInt(sb.substring(i, i + 1));
            // System.out.print(t+" ");
            if (t == 0) {
                r = 1;
                continue;
            }
            r *= t;
            // System.out.println(r);
            if ((i + 1) >= j) {
                // System.out.println("==========="+r);
                if (t1 < r) {
                    t1 = r;
                }
                i = h;
                r = 1;
                j++;
                h++;
            }
        }
        System.out.println(t1);
        sw.stop();
        System.out.println(sw.prettyPrint());
    }
}